{
    "projects": [
        {
            "id": 0,
            "title": "Car Configurator",
            "tag": "Personal project",
            "picture": "https://i.ibb.co/NLNHzCx/car-Configurator.png",
            "perex": "Simplified BMW car configurator made in React with Redux state managment. Main focus of this project was to create site with a bit heavier state managment.",
            "description": "At first I wanted to create some sort of website using React and Redux. After some time the idea of car configurator came in my mind. I really liked because it was something a bit different so I decided to build my own version of BMW car configurator. It is way more simplified but it is working just fine.",
            "WPSupport": false,
            "ReactSupport": true,
            "HTMLSupport": true,
            "CSSSupport": true,
            "JSSupport": false,
            "FigmaSupport": true,
            "ContentfulSupport": false,
            "WebsiteLink": "https://martin-zvozil-car-configurator.netlify.app/",
            "GitHubEnabled": true,
            "GitHubLink": "https://github.com/Fortheart/Car-Configurator"
        },
        {
            "id": 1,
            "title": "Foťák na dlani",
            "tag": "Client work",
            "picture": "https://i.ibb.co/swV8FxJ/fotak-na-dlani.png",
            "perex": "I've teamed up with a person who makes photography as a side hustle. He has many photos on social medias but he wanted some sort of portfolio where he could showcase all his photos.",
            "description": "I've teamed up with a person who makes photography as a side hustle. He has many photos on social medias but he wanted some sort of portfolio where he could showcase all his photos. I started to create a design for his portfolio and when we agreed on the design I started to build the website.",
            "WPSupport": true,
            "ReactSupport": false,
            "HTMLSupport": false,
            "CSSSupport": false,
            "JSSupport": false,
            "FigmaSupport": true,
            "ContentfulSupport": false,
            "WebsiteLink": "http://fotaknadlani.cz/",
            "GitHubEnabled": false,
            "GitHubLink": ""
        },
        {
            "id": 2,
            "title": "Detail Software",
            "tag": "Client work",
            "picture": "https://i.ibb.co/XbzQXr9/detail-software.png",
            "perex": "Website for new game studio Detail Software. My client will be able to show their new game projects and news. Website will also act as main web presentation for their studio. For easy content management is Website connected to headless CMS Contentful.",
            "description": "They provided me with just a design of a homepage and they asked me to redesign it from scratch. When I redesigned the homepage I started to design the rest of the website. We decided to build this website in React because my customers wanted more flexibility than WordPress provides. Once I've build the frontend in React I connected it to the contetful headless CMS for some basic backend. We've agreed that we build more robust backend when it will be needed but so far the Conteful CMS is more than enough. The website is now ready but my clients did not populate it with data so far, so I am providing just a Netlify link for preview. ",
            "WPSupport": false,
            "ReactSupport": true,
            "HTMLSupport": true,
            "CSSSupport": true,
            "JSSupport": false,
            "FigmaSupport": true,
            "ContentfulSupport": true,
            "WebsiteLink": "https://martinzvozil.netlify.app/",
            "GitHubEnabled": false,
            "GitHubLink": ""
        },
        {
            "id": 3,
            "title": "Priority to do list",
            "tag": "Personal project",
            "picture": "https://i.ibb.co/ZhfvyNg/priority-todolist.png",
            "perex": "This is my to do list project which can filter out priorities and uses localstorage for saving data.",
            "description": "Everyone has a to do list in a portfolio. I really wanted to do something simple like to do list but I wanted to add something extra to it. So I decide to take the idea of TO DO LIST IN A BOOK where you have different priorities for each task. This way I was able to create basic filter functionality. I also wanted to be able to save data somehow without the use of database or some headless cms. I decided to use localstorage for some basic saving ability.",
            "WPSupport": false,
            "ReactSupport": true,
            "HTMLSupport": true,
            "CSSSupport": true,
            "JSSupport": false,
            "FigmaSupport": true,
            "ContentfulSupport": false,
            "WebsiteLink": "https://fortheart.github.io/PriorityToDoList/",
            "GitHubEnabled": true,
            "GitHubLink": "https://github.com/Fortheart/PriorityToDoList"
        },
        {
            "id": 4,
            "title": "Moravacars",
            "tag": "Client work",
            "picture": "https://i.ibb.co/Mc3KZCr/moravacars.png",
            "perex": "This website was created for my client who is reselling used cars. His clients will fill up form on the website and specify what car they want. Once my client has all specs he’ll source the car for them.",
            "description": "My client has been reselling and importing cars for many years. He recently started his youtube channel where he has been promoting his job and showing cars that he is able to get for his customers. He got popular fairly quickly because he is always trying to get the best cars that he can find in desired price range and specs. As he grew more and more popular with his business, he got also very frustrated about his poorly made website. He wanted to show on his website his recent videos from youtube, write some news and also enable customers to contact him through his website. He also wanted to make this website his main promotion.",
            "WPSupport": true,
            "ReactSupport": false,
            "HTMLSupport": false,
            "CSSSupport": false,
            "JSSupport": false,
            "FigmaSupport": true,
            "ContentfulSupport": false,
            "WebsiteLink": "http://moravacars.cz/",
            "GitHubEnabled": false,
            "GitHubLink": ""
        },
        {
            "id": 5,
            "title": "Taylors portfolio",
            "tag": "Personal project",
            "picture": "https://i.ibb.co/ys1QP27/Screenshot-2020-08-18-at-17-34-56.png",
            "perex": "This was just a design idea of a website for a photographer. I also wanted to add some effects like glitching so I decided to create this design i html and use some JS libraries to create those effects.",
            "description": "This was just a design idea of a website for a photographer. I also wanted to add some effects like glitching so I decided to create this design i html and use some JS libraries to create those effects.",
            "WPSupport": false,
            "ReactSupport": false,
            "HTMLSupport": true,
            "CSSSupport": true,
            "JSSupport": true,
            "FigmaSupport": true,
            "ContentfulSupport": false,
            "WebsiteLink": "https://fortheart.github.io/Taylors-Portfolio/",
            "GitHubEnabled": true,
            "GitHubLink": "https://github.com/Fortheart/Taylors-Portfolio"
        },
        {
            "id": 6,
            "title": "Fast writer",
            "tag": "Personal project",
            "picture": "https://i.ibb.co/TmVmQ4n/fast-writer.png",
            "perex": "This is one of my first ever projects in JS. It is just a simple speed writing game.",
            "description": "This is one of my first ever projects in JS. It is just a simple speed writing game.",
            "WPSupport": false,
            "ReactSupport": false,
            "HTMLSupport": true,
            "CSSSupport": true,
            "FigmaSupport": true,
            "JSSupport": true,
            "ContentfulSupport": false,
            "WebsiteLink": "https://fortheart.github.io/Fast-Writer/",
            "GitHubEnabled": true,
            "GitHubLink": "https://github.com/Fortheart/Fast-Writer"
        }
    ]
}